Revit.Elements.AppearanceAssetElement.InternalAppearanceAssetElement
Internal reference to the Element

Revit.Elements.AppearanceAssetElement.InternalElement
Reference to the Element

Revit.Elements.AppearanceAssetElement.#ctor(Autodesk.Revit.DB.AppearanceAssetElement)
Private constructor for DSAppearanceAssetElement
appearanceAssetElement:

Revit.Elements.AppearanceAssetElement.InitAppearanceAssetElement(Autodesk.Revit.DB.AppearanceAssetElement)
Initialize a AppearanceAssetElement element
appearanceAssetElement:

Revit.Elements.AppearanceAssetElement.InternalSetAppearanceAssetElement(Autodesk.Revit.DB.AppearanceAssetElement)
Set the internal Element, ELementId, and UniqueId
appearanceAssetElement:

Revit.Elements.AppearanceAssetElement.GetRenderingAssetTextureImages
Get texture image path of the appearance asset
The list of all the properties that have images connected. A property's meaning can be queried in Revit API documentation, e.g., for "GenericDiffuse.UnifiedbitmapBitmap", it means property "GenericDiffuse" connects a texture asset which has a "UnifiedbitmapBitmap" property
The list of all the image path

Revit.Elements.AppearanceAssetElement.SetRenderingAssetTextureImage(System.String,System.String)
Set texture image path of the appearance asset
imageProperty: A property that has a image connected. This can be queried by calling GetRenderingAssetTextureImages first
imagePath: File path of the image
Returns: AppearanceAssetElement

Revit.Elements.AppearanceAssetElement.FromExisting(Autodesk.Revit.DB.AppearanceAssetElement,System.Boolean)
Wrap an element in the associated DS type
appearanceAssetElement: The appearanceAssetElement
isRevitOwned:
Returns: